In [3]:
import numpy as np
import pandas as pd

### Fig 1

In [24]:
df = pd.read_excel("cpi.xlsx", skiprows=6)
df.columns = ["Date"] + list(df.columns[1:])
# parse string from form "Jan 2019" to datetime
df["Date"] = pd.to_datetime(df["Date"], format="%b %Y")
# Rename "CPI excl energy, food, alcohol & tobacco" to "CPI_excl"
df = df.rename(columns={"CPI excl energy, food, alcohol & tobacco": "CPI_excl"})
# Divide everything except date by 100
df.iloc[:, 1:] = df.iloc[:, 1:] / 100
# Melt
df = df.melt(id_vars="Date", var_name="Series", value_name="Value")
df.to_json("fig1_data.json", orient="records")

### Fig 2

In [41]:
df = pd.read_excel("bank rate.xlsx")
df['Rate'] = df['Rate'].astype(float)/100
df.rename(columns={'Rate': 'Value', 'Date Changed': 'Date'}, inplace=True)
df['Series'] = 'Bank Rate'
df = df.query("Date >= '05-01-2004'")
df.to_json("fig2_data.json", orient="records")

### Fig 3

In [66]:
df = pd.read_excel("fig3_data.xlsx")
# Convert from 2007 Q1 to 2007-01-01, 2007 Q2 to 2007-04-01 etc
df["Date"] = df["Date"].apply(lambda x: f"{x[:4]}-{ str((int(x[-1])-1) *3 + 1).zfill(2)}-01")
df["Value"] = df["Value"]/100
df.to_json("fig3_data.json", orient="records")

### Fig 4

In [88]:
df = pd.read_excel("FTB mortgage payment.xlsx", skiprows=4)
df.columns = ["Date"] + list(df.columns[1:])
df = df[['Date', 'UK']]
df["Date"] = df["Date"].apply(lambda x: f"{x[-4:]}-{ str((int(x[1])-1) *3 + 1).zfill(2)}-01")
df.rename(columns={'UK': 'Value'}, inplace=True)
df['Series'] = 'Payments'
df['Value'] = df['Value'].astype(float)
# Get index of row with Date  2000-01-01
idx = df[df['Date'] == '2000-01-01'].index[0]
# Drop all rows before 2000-01-01
df = df.iloc[idx:]
df.to_json("fig4_data.json", orient="records")

### Fig 5

In [91]:
df = pd.read_excel("fig5_data.xlsx")
df.to_json("fig5_data.json", orient="records")

### Fig 6

In [97]:
df = pd.read_excel("fig6_data.xlsx")
df.to_json("fig6_data.json", orient="records")

### Fig 7

In [117]:
df = pd.read_excel("regional hpi.xls", skiprows=6)
df.columns = ['Date'] + list(df.columns[1:])
df = df.melt(id_vars="Date", var_name="Series", value_name="Value")
# Parse 2005 Feb to 2005-02-01
df.dropna(inplace=True)
df["Date"] = pd.to_datetime(df["Date"], format="%Y %b")
df.to_json("fig7_data.json", orient="records")

### Fig 8

In [129]:
df = pd.read_excel("fig8_data.xlsx")
df = df.melt(id_vars="Date", var_name="Series", value_name="Value")
df = df.dropna()
df["Date"] = df["Date"].apply(lambda x: f"{x[:4]}-{ str((int(x[-1])-1) *3 + 1).zfill(2)}-01")
df['Value'] = df['Value'].astype(float)/100
df.to_json("fig8_data.json", orient="records")

### Fig 9

In [139]:
df = pd.read_excel("fig9_data.xlsx")
df["Date"] = df["Date"].apply(lambda x: f"{x[:4]}-{ str((int(x[-1])-1) *3 + 1).zfill(2)}-01")
df = df.melt(id_vars="Date", var_name="Series", value_name="Value")
df['Value'] = df['Value'].astype(float)/100
df.to_json("fig9_data.json", orient="records")

### Fig 10

In [153]:
df = pd.read_excel("regional rental rates.xlsx", skiprows=6)
df.columns = ['Date'] + list(df.columns[1:])
df = df.melt(id_vars="Date", var_name="Series", value_name="Value")
df.dropna(inplace=True)
df["Date"] = df["Date"].str.strip()
# Replace Long Months with Short Months to parse
df["Date"] = df["Date"].str.replace("January", "Jan")
df["Date"] = df["Date"].str.replace("February", "Feb")
df["Date"] = df["Date"].str.replace("March", "Mar")
df["Date"] = df["Date"].str.replace("April", "Apr")
df["Date"] = df["Date"].str.replace("May", "May")
df["Date"] = df["Date"].str.replace("June", "Jun")
df["Date"] = df["Date"].str.replace("July", "Jul")
df["Date"] = df["Date"].str.replace("August", "Aug")
df["Date"] = df["Date"].str.replace("September", "Sep")
df["Date"] = df["Date"].str.replace("October", "Oct")
df["Date"] = df["Date"].str.replace("November", "Nov")
df["Date"] = df["Date"].str.replace("December", "Dec")
df["Date"] = pd.to_datetime(df["Date"], format="%b %Y")
df['Value'] = df['Value'].astype(float)/100
df.to_json("fig10_data.json", orient="records")

          Date  Series  Value
0   2016-01-01      UK  0.026
1   2016-02-01      UK  0.026
2   2016-03-01      UK  0.026
3   2016-04-01      UK  0.026
4   2016-05-01      UK  0.025
..         ...     ...    ...
259 2022-12-01  London  0.040
260 2023-01-01  London  0.043
261 2023-02-01  London  0.046
262 2023-03-01  London  0.048
263 2023-04-01  London  0.050

[264 rows x 3 columns]

In [102]:
['Date'] + list(df.columns[1:])

['Date', 'England', 'Wales ', 'Scotland ', 'Northern Ireland']

In [80]:
"Q1 1983"[-4:]

'1983'

In [82]:
df

           Date     Value    Series
0    1983-01-01  0.253420  Payments
1    1983-04-01  0.253402  Payments
2    1983-07-01  0.276358  Payments
3    1983-10-01  0.279723  Payments
4    1984-01-01  0.286642  Payments
..          ...       ...       ...
156  2022-01-01  0.303112  Payments
157  2022-04-01  0.318559  Payments
158  2022-07-01  0.335847  Payments
159  2022-10-01  0.349003  Payments
160  2023-01-01  0.370433  Payments

[161 rows x 3 columns]

# Quarter 1: 2019-01-01, Quarter 2: 2019-04-01, Quarter 3: 2019-07-01, Quarter 4: 2019-10-01

In [52]:
df

          Date  Value               Series
0   2007-01-01  5.336     Fixed Rate Loans
1   2007-02-01  5.525     Fixed Rate Loans
2   2007-03-01  5.770     Fixed Rate Loans
3   2007-04-01  6.016     Fixed Rate Loans
4   2008-01-01  5.924     Fixed Rate Loans
..         ...    ...                  ...
125 2022-01-01  2.351  Variable Rate Loans
126 2022-02-01  2.797  Variable Rate Loans
127 2022-03-01  3.470  Variable Rate Loans
128 2022-04-01  4.485  Variable Rate Loans
129 2023-01-01  4.996  Variable Rate Loans

[130 rows x 3 columns]

In [15]:
type(df.iloc[0].Date)

str

In [23]:
df

          Date    Series  Value
0   2013-04-01       CPI  0.024
1   2013-05-01       CPI  0.027
2   2013-06-01       CPI  0.029
3   2013-07-01       CPI  0.028
4   2013-08-01       CPI  0.027
..         ...       ...    ...
479 2022-12-01  CPI_excl  0.063
480 2023-01-01  CPI_excl  0.058
481 2023-02-01  CPI_excl  0.062
482 2023-03-01  CPI_excl  0.062
483 2023-04-01  CPI_excl  0.068

[484 rows x 3 columns]